<?php

//中文语言包

return [
    'empty'     => [
        'method'   => ':class:::method طريقة غير موجودة。',
        'attrs'    => 'اي المعلمات اللازمة',
        'attr'     => ':attr اي المعلمات اللازمة',
        'property' => ':nameالسمة لا وجود لها'
    ],
    'request'   => [
        'error'        => 'طلب خطأ',
        'noPermission' => 'إذن الوصول',
    ],
    'data'      => [
        'typeError' => 'خطأ في نوع البيانات التي يجب أن تكون مغلقة أو مجموعة'
    ],
    'route'     => [
        'miss' => 'العنوان الذي قمت بزيارته غير موجود'
    ],
    'upload'    => [
        'filesizeRrror' => 'تحميل حجم الملف يتجاوز حدود النظام',
        'fileExtError'  => 'لا تدعم هذا النوع من الملفات ، يرجى تحميل الصور ، GIF ، BMP ، بابوا نيو غينيا ، JPG ، دوك ، XLS ، XLSX ، XLSM ، جزء لكل تريليون ، PPTX الملفات .',
        'fileMineError' => 'لا تدعم هذا النوع من الملفات ، يرجى تحميل الصور ، GIF ، BMP ، بابوا نيو غينيا ، JPG ، دوك ، XLS ، XLSX ، XLSM ، جزء لكل تريليون ، PPTX الملفات .'
    ],
    'insert'    => [
        'succ'   => 'إضافة بنجاح !',
        'fail'   => 'إضافة فشلت !',
        'exists' => 'نفس البيانات موجودة بالفعل ، لا تضيف！',
    ],
    'delete'    => [
        'succ' => 'حذف بنجاح !',
        'fail' => 'حذف فشلت !',
    ],
    'update'    => [
        'succ' => 'تعديل بنجاح !',
        'fail' => 'تعديل فشلت !',
    ],
    'query'     => [
        'succ' => 'الاستعلام بنجاح !',
        'fail' => 'فشل الاستعلام !',
    ],
    'operation' => [
        'succ' => 'عملية ناجحة !',
        'fail' => 'العملية فشلت !',
    ],
];
