<?php

//俄语语言包

return [
    'empty'     => [
        'method'   => 'метод :class:::method не существует。',
        'attrs'    => 'отсутствие необходимых параметров。',
        'attr'     => 'отсутствие необходимых параметров :attr。',
        'property' => ':name атрибут не существует'
    ],
    'request'   => [
        'error' => 'Ошибка запроса'
    ],
    'data'      => [
        'typeError' => 'Неверный тип данных。Она должна быть замкнутой или массивной'
    ],
    'route'     => [
        'miss' => 'адрес вашего посещения не существует'
    ],
    'upload'    => [
        'filesizeRrror' => 'выход из системного ограничения',
        'fileExtError'  => 'пока не поддерживается файл типа，пожалуйста.jpeg, .gif, .bmp, .png, .jpg, .doc, .docx, .xls, .xlsx, .xlsm, .ppt, .pptx Документация',
        'fileMineError' => 'пока не поддерживается файл типа，пожалуйста.jpeg, .gif, .bmp, .png, .jpg, .doc, .docx, .xls, .xlsx, .xlsm, .ppt, .pptx Документация'
    ],
    'insert'    => [
        'succ'   => 'Добавление успешно！',
        'fail'   => 'Ошибка добавления！',
        'exists' => 'одни и те же данные！',
    ],
    'delete'    => [
        'succ' => 'Удалено успешно！',
        'fail' => 'Ошибка удаления！',
    ],
    'update'    => [
        'succ' => 'изменение завершено！',
        'fail' => 'Ошибка изменения！',
    ],
    'query'     => [
        'succ' => 'запрос выполнен！',
        'fail' => 'Ошибка запроса！',
    ],
    'operation' => [
        'succ' => 'Операция прошла успешно！',
        'fail' => 'Ошибка операции！',
    ],
];
